GHB2/src/Documents/гхб_ЗакреплениеОтветственногоЗаЛокацию/гхб_ЗакреплениеОтветственногоЗаЛокацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_ЗакреплениеОтветственногоЗаЛокацию</name>
  <registerRecords>InformationRegister.гхб_ОтветственныеЗаЛокации</registerRecords>
  <attributes>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЛокацию</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЛокациюСуществующий</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

GHB2/src/InformationRegisters/гхб_ОтветственныеЗаЛокации/гхб_ОтветственныеЗаЛокации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ОтветственныеЗаЛокации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ОтветственныйЗаЛокацию</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Enums/гхб_ТипыСобытийОбъектовБД/гхб_ТипыСобытийОбъектовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ТипыСобытийОбъектовБД</name>
  <enumValues>
    <name>ПервоеПроведениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПересчетПлощадиПомещений</name>
  </enumValues>
  <enumValues>
    <name>ПланируемаяБлокировкаПользователя</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПриПроведении</name>
  </enumValues>
  <enumValues>
    <name>РассылкаПоСтатусамКонсервацииПомещений</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Documents/гхб_ЗакреплениеОтветственногоЗаЛокацию/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ РегистрыСведений.гхб_СобытияОбъектовБД.СобытиеПоОбъектуБыло(Ссылка, Перечисления.гхб_ТипыСобытийОбъектовБД.ПервоеПроведениеДокумента) Тогда
		
		ДвиженияПоЗакреплениюОтветственныхПоЛокациям();
		
		РегистрыСведений.гхб_СобытияОбъектовБД.ЗаписатьДанныеСобытияОбъекта(Ссылка, Перечисления.гхб_ТипыСобытийОбъектовБД.ПервоеПроведениеДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	Если (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) 
	   И РегистрыСведений.гхб_СобытияОбъектовБД.СобытиеПоОбъектуБыло(Ссылка, Перечисления.гхб_ТипыСобытийОбъектовБД.ПервоеПроведениеДокумента) Тогда
	   
	   	Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(гхб_Ответственный) Тогда
		гхб_Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	гхб_Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияПоЗакреплениюОтветственныхПоЛокациям()
	
	_Строка = Движения.гхб_ОтветственныеЗаЛокации.Добавить();
	_Строка.Период = Дата;
	_Строка.Регистратор = Ссылка;
	_Строка.Локация = Локация;
	_Строка.ОтветственныйЗаЛокацию = ОтветственныйЗаЛокацию;
			
	Движения.гхб_ОтветственныеЗаЛокации.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
